const AboutUs = () => {
  return (
    <div className="h-screen">
      <div className="md:max-w-6xl mx-auto px-6 md:px-0 py-6 text-white flex flex-col text-center gap-6">
        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7">
            আমাদের সম্পর্কে
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              {import.meta.env.VITE_SITE_NAME} একটি শীর্ষস্থানীয় অনলাইন গেমিং
              ওয়েবসাইট, যা স্পোর্টস বেটিং, অনলাইন ক্যাসিনো এবং অনলাইন গেম
              সরবরাহ করে। আমরা ২০১৫ সাল থেকে এশিয়া প্যাসিফিক বাজারে সেবা দিয়ে
              আসছি। আমরা নিয়ম ও শর্তাবলীতে বর্ণিত বিভিন্ন এখতিয়ারে
              সম্পূর্ণরূপে লাইসেন্সপ্রাপ্ত এবং নিয়ন্ত্রিত এবং
              <br /> {import.meta.env.VITE_SITE_NAME} এই নিয়মের মধ্যে কঠোরভাবে
              কাজ করে।
            </p>

            <p>
              নিরাপদ এবং ব্যক্তিগত পরিবেশ এবং আমাদের পণ্যের অখণ্ডতা{" "}
              {import.meta.env.VITE_SITE_NAME} অনলাইন গেমিং অভিজ্ঞতার মৌলিক
              চালক। আমাদের কাছে সর্বাধিক উন্নত নিরাপত্তা ব্যবস্থা রয়েছে এবং
              একটি সম্পূর্ণ নিরাপদ এবং ন্যায্য ইন্টারনেট জুয়া অভিজ্ঞতা নিশ্চিত
              করার জন্য আমাদের গেমস এবং প্রক্রিয়াগুলি ক্রমাগত নিরীক্ষা করছে।
              আমরা <br /> আপনার সমস্ত তথ্য গোপন রাখি, এবং আমরা আমাদের গোপনীয়তা
              নীতি অনুসারে ছাড়া এটি কখনও শেয়ার করব না বা তৃতীয় পক্ষের কাছে
              বিক্রি করব না।
            </p>

            <p>
              আমরা স্পোর্টস বাজার এবং বিশ্বব্যাপী অন্যান্য স্পোর্টস ইভেন্টগুলি
              জুড়ে সর্বোত্তম মূল্য দেওয়ার চেষ্টা করি। আমরা আমাদের ক্যাসিনোতে
              বিভিন্ন ধরণের লাইভ গেম এবং স্লট গেম সরবরাহ করি।
              {import.meta.env.VITE_SITE_NAME} এ আমরা প্রতিশ্রুতি দিচ্ছি আপনি
              বিশ্বের সর্বোচ্চ শ্রেণীর অনলাইন গেমিং বিনোদন উপভোগ করবেন।
            </p>

            <p>
              W প্রতি সপ্তাহে 7 দিন 24 ঘন্টা লাইভ কাস্টমার সাপোর্ট পাওয়া যায়,
              আমাদের অত্যন্ত প্রশিক্ষিত এবং বন্ধুত্বপূর্ণ কর্মীরা নিশ্চিত করবে
              যে কোন প্রশ্ন দ্রুত, ভদ্রভাবে এবং দক্ষতার সাথে মোকাবিলা করা হবে
              এবং সমাধান করা হবে।
            </p>

            <p>
              আমাদের মিশন দায়িত্বশীল খেলোয়াড়দের জন্য সেরা অনলাইন জুয়া
              অভিজ্ঞতা প্রদান করা, দয়া করে নির্দ্বিধায় আপনার মন্তব্য বা
              পরামর্শ সহ ফোন বা ইমেলের মাধ্যমে আমাদের সাথে যোগাযোগ করুন।
            </p>

            <p>
              আমরা আপনার সুবিধার্থে বিভিন্ন ধরণের নিরাপদ এবং সহজ পেমেন্ট পদ্ধতি
              অফার করি। আমরা “আপনার গ্রাহককে জানুন” (KYC) এবং মানি লন্ডারিং
              বিরোধী (AML) নীতি মেনে চলি এবং তৃতীয় পক্ষের আর্থিক ও নিয়ন্ত্রক
              কর্তৃপক্ষের সাথে সহযোগিতার সর্বোচ্চ মান নিশ্চিত করতে সহযোগিতা করি।
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
