const PrivacyPolicyInfo = () => {
  return (
    <div className="h-auto">
      <div className="md:max-w-6xl mx-auto px-6 md:px-0 py-6 text-white flex flex-col gap-6">
        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7 uppercase">
            গোপনীয়তা নীতি
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আপনার গোপনীয়তা আমাদের কাছে গুরুত্বপূর্ণ, এবং আমরা আপনার ব্যক্তিগত
              তথ্য রক্ষা করতে প্রতিশ্রুতিবদ্ধ। কেন আমরা আপনার ব্যক্তিগত তথ্য
              সংগ্রহ করি এবং কীভাবে আমরা তা ব্যবহার করি সে সম্পর্কে আমরা স্পষ্ট
              ও খোলামেলা থাকব। যেখানে আপনার পছন্দ বা অধিকার আছে, আমরা আপনাকে
              সেগুলি ব্যাখ্যা করব৷
            </p>

            <p>
              এই গোপনীয়তা নীতি ব্যাখ্যা করে যে আপনি যখন আমাদের ওয়েবসাইটগুলির
              একটি ব্যবহার করছেন তখন মেগা ক্যাসিনো ওয়ার্ড কীভাবে আপনার
              ব্যক্তিগত তথ্য ব্যবহার করে।
            </p>

            <p>
              আপনি যদি এই গোপনীয়তা নীতির মধ্যে থাকা কোনও বিবৃতির সাথে একমত না
              হন তবে দয়া করে আমাদের ওয়েবসাইটে আর এগিয়ে যাবেন না। অনুগ্রহ করে
              সচেতন থাকুন যে আমাদের ওয়েবসাইটে একটি অ্যাকাউন্ট নিবন্ধন করা, বাজি
              রাখা এবং তহবিল স্থানান্তর করা আমাদের শর্তাবলী এবং আমাদের গোপনীয়তা
              নীতির সাথে আপনার সম্পূর্ণ চুক্তির নিশ্চিতকরণ হিসাবে বিবেচিত হবে।
              আপনি যে কোনো সময় ওয়েবসাইট ব্যবহার বন্ধ করার অধিকার আছে; যাইহোক,
              আমাদের এখনও আইনত আপনার কিছু ব্যক্তিগত তথ্য ধরে রাখার প্রয়োজন হতে
              পারে।
            </p>

            <p>
              আমরা পর্যায়ক্রমে এই গোপনীয়তা নীতিতে পরিবর্তন করতে পারি এবং
              আমাদের প্ল্যাটফর্মে পরিবর্তিত শর্তাবলী পোস্ট করে এই পরিবর্তনগুলি
              সম্পর্কে আপনাকে অবহিত করব। আমরা সুপারিশ করি যে আপনি নিয়মিত এই
              গোপনীয়তা নীতি পুনরায় দেখুন।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            আপনার তথ্য নিয়ন্ত্রণে কে?
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              এই গোপনীয়তা নীতি জুড়ে, মেগা ক্যাসিনো ওয়ার্ল্ড আমাদের সহযোগী এবং
              সহযোগীদের সাথে একসাথে (সম্মিলিতভাবে, “আমরা” বা “আমাদের” বা
              “আমাদের”) আপনার ব্যক্তিগত ডেটা সংগ্রহ করার উপায়গুলি এবং মেগা
              ক্যাসিনো যে উদ্দেশ্যে আপনার ব্যক্তিগত ডেটা ব্যবহার করে তা
              নিয়ন্ত্রণ করে। বিশ্ব, প্রযোজ্য ইউরোপীয় ডেটা সুরক্ষা আইনের
              উদ্দেশ্যে “ডেটা কন্ট্রোলার” হিসাবে কাজ করছে।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            আমাদের ডেটা সুরক্ষা অফিসার
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আপনার যদি উদ্বেগ থাকে বা মেগা ক্যাসিনো ওয়ার্ল্ড কীভাবে আপনার
              ব্যক্তিগত তথ্য পরিচালনা করে সে সম্পর্কে আরও তথ্য চান, আপনি
              info@casino{import.meta.env.VITE_SITE_NAME}.com-এ আমাদের ডেটা
              সুরক্ষা অফিসারের সাথে যোগাযোগ করতে পারেন।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            আমরা আপনার সম্পর্কে যেসব তথ্য সংগ্রহ করি
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আপনি একটি অ্যাকাউন্ট সেট আপ, বাজি স্থাপন এবং ওয়েবসাইটের
              পরিষেবাগুলি ব্যবহার করার প্রক্রিয়াতে আমাদের এই তথ্য প্রদান করেন।
              আমাদের ওয়েবসাইট এবং সম্পর্কিত পরিষেবাগুলির নির্দিষ্ট অংশগুলিতে
              আপনাকে অ্যাক্সেস দেওয়ার জন্য এই তথ্যটি প্রয়োজন।
            </p>
            <p>এই ডেটা সংগ্রহ করা হয় যখন আপনি:</p>
            <ol className="list-disc list-inside text-white">
              <li>মেগা ক্যাসিনো ওয়ার্ল্ডে একটি অ্যাকাউন্ট নিবন্ধন করুন;</li>
              <li>ওয়েবসাইট ব্যবহার করার সময় স্বেচ্ছায় এটি প্রদান করুন;</li>
              <li>
                ওয়েবসাইটের সর্বজনীন এলাকায় ব্যক্তিগতভাবে তথ্য প্রকাশ করুন; এবং
              </li>
              <li>
                আপনি যখন আমাদের গ্রাহক সহায়তা দলের সাথে যোগাযোগ করেন তখন এটি
                প্রদান করুন৷
              </li>
            </ol>

            <p>তথ্য আপনার অন্তর্ভুক্ত:</p>

            <ol className="list-disc list-inside text-white">
              <li> ব্যবহারকারীর নাম;</li>
              <li> প্রথম নাম এবং উপাধি নাম</li>
              <li>ইমেল ঠিকানা;</li>
              <li>আবাসিক ঠিকানা;</li>
              <li>ফোন নম্বর;</li>
              <li>বিলিং ঠিকানা;</li>
              <li>শনাক্তকরণ নথি;</li>
              <li>ঠিকানার নথির প্রমাণ;</li>
              <li>লেনদেনের ইতিহাস;</li>
              <li>ওয়েবসাইট ব্যবহারের পছন্দ;</li>
              <li>
                আমাদের প্ল্যাটফর্ম ব্যবহার করার সময় আপনি আমাদের প্রদান করেন এমন
                অন্য কোনো তথ্য; এবং
              </li>
              <li>
                ক্রেডিট/ডেবিট কার্ডের বিশদ বিবরণ, বা অন্যান্য অর্থপ্রদানের তথ্য
              </li>
            </ol>

            <p>
              তথ্য বিলিং উদ্দেশ্যে এবং অপ্রাপ্তবয়স্কদের সুরক্ষার জন্যও
              প্রয়োজন৷ আপনি গ্রাহক সহায়তার সাথে যোগাযোগ করে এই তথ্য সংশোধন এবং
              আপডেট করতে পারেন। এই ডেটা শুধুমাত্র অভ্যন্তরীণ ব্যবহারের জন্য এবং
              নীচে উল্লেখ করা ছাড়া কোনও তৃতীয় পক্ষের কাছে কখনই পাঠানো হয় না।
            </p>

            <p>
              আমাদের গ্রাহক যোগাযোগ কেন্দ্র থেকে টেলিফোন কলগুলি প্রশিক্ষণ এবং
              নিরাপত্তার উদ্দেশ্যে রেকর্ড করা হয় এবং আপনার প্রাপ্ত পরিষেবা থেকে
              উদ্ভূত যেকোন প্রশ্নের সমাধান করা হয়।
            </p>

            <p>
              আপনি যদি আমাদের পণ্যগুলির সাথে (যেমন চ্যাট রুম) প্রদান করা সামাজিক
              বৈশিষ্ট্যগুলির মধ্যে যেকোনও অংশগ্রহণ করতে চান তবে মেগা ক্যাসিনো
              ওয়ার্ল্ড রেকর্ড সংরক্ষণ করতে পারে বা অন্যথায় এই ডেটা প্রক্রিয়া
              করতে পারে।
            </p>

            <p>
              মেগা ক্যাসিনো ওয়ার্ল্ড আমাদের ওয়েবসাইটটিকে যতটা সম্ভব
              ব্যবহারকারী বান্ধব এবং ইন্টারনেটে খুঁজে পাওয়া সহজ করার চেষ্টা
              করে। মেগা ক্যাসিনো ওয়ার্ল্ড আপনি কীভাবে সাইটটি ব্যবহার করেন তার
              ডেটা সংগ্রহ করে, যা আপনাকে ব্যক্তিগতভাবে সনাক্ত করে না। আপনি যখন
              পরিষেবাগুলির সাথে ইন্টারঅ্যাক্ট করেন, তখন আমাদের সার্ভারগুলি আপনার
              জন্য একটি অ্যাক্টিভিটি লগ রাখে যা কিছু প্রশাসনিক এবং ট্রাফিক তথ্য
              সংগ্রহ করে যার মধ্যে রয়েছে: উৎস আইপি ঠিকানা, অ্যাক্সেসের সময়,
              অ্যাক্সেসের তারিখ, ওয়েব পৃষ্ঠা(গুলি) পরিদর্শন করা, ভাষা ব্যবহার,
              সফ্টওয়্যার ক্র্যাশ রিপোর্ট এবং ব্যবহৃত ব্রাউজারের ধরন। এই তথ্য
              আমাদের পরিষেবার বিধান এবং মানের জন্য অপরিহার্য.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicyInfo;
