const ResponsibleGameing = () => {
  return (
    <div className="">
      <div className="md:max-w-6xl mx-auto px-6 md:px-0 py-6 text-white flex flex-col gap-6">
        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7">
            দায়িত্বশীল গেমিং
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              মেগা ক্যাসিনো ওয়ার্ল্ড একটি চমৎকার এবং উপভোগ্য গেমিং অভিজ্ঞতা
              প্রদান করতে এবং সমস্যাযুক্ত কর্মকান্ড দায়িত্বের সাথে প্রতিরোধ করে
              । আমরা সমস্ত খেলোয়াড়দের দায়িত্বহীনভাবে খেলা না করে নিম্নলিখিত
              বিষয়গুলি বিবেচনা করার পরামর্শ দিই:
            </p>
            <ol className="list-disc list-inside text-white">
              <li>বিনোদনের জন্য খেলুন, অর্থ উপার্জনের জন্য নয়।</li>
              <li>ক্ষতির টাকা ওঠানোর জন্য উন্মুখ হবেন না।</li>
              <li>নিজের জন্য সীমা নির্ধারণ করুন।</li>
              <li>জুয়াকে আপনার দৈনন্দিন দায়িত্বে হস্তক্ষেপ করতে দেবেন না।</li>
              <li>কখনই জুয়া খেলবেন না যদি না আপনি লোকসান কভার করতে পারেন।</li>
              <li>বিরতি নিন।</li>
            </ol>
            <p>
              নিচের প্রশ্নগুলো দেখুন। তাদের অধিকাংশের উত্তর যদি “হ্যাঁ” হয়,
              তাহলে আমরা আপনাকে জুয়া খেলা থেকে আপনার জীবনকে নেতিবাচকভাবে
              প্রভাবিত না করার জন্য পদক্ষেপ নিতে পরামর্শ দিই:
            </p>

            <ol className="list-disc list-inside text-white">
              <li>জুয়া কি আপনার কাজকে প্রভাবিত করে?</li>
              <li>জুয়া খেলে কি পরিবার/বন্ধুদের সাথে তর্ক হয়েছে?</li>
              <li>আপনি কি সবসময় আপনার পরাজয় জিতে ফিরে আসেন?</li>
              <li>আপনি কি জুয়া খেলার জন্য টাকা ধার করেছেন?</li>
              <li>আপনি কি জুয়া খেলাকে আয়ের উৎস হিসেবে দেখেন?</li>
              <li>আপনি কি আপনার জুয়াকে সীমিত করা কঠিন মনে করেন?</li>
            </ol>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7">
            কি করতে হবে?
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              নীচে তালিকাভুক্ত নামকরা সংস্থাগুলি যারা জুয়ার সমস্যাগুলির সাথে
              লড়াই করে তাদের সাহায্য করার জন্য প্রতিশ্রুতিবদ্ধ, এবং যে কোনো
              সময় যোগাযোগ করা যেতে পারে:
            </p>

            <ol className="list-disc list-inside text-white">
              <li>জুয়াড়ি বেনামী</li>
              <li>জুয়া থেরাপি</li>
              <li>গ্যামকেয়ার</li>
            </ol>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7">
            আমরা কিভাবে সাহায্য করতে পারি?
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আমরা তাদের জুয়ার আচরণ সম্পর্কে উদ্বিগ্ন সকল খেলোয়াড়কে তাদের
              গেমিং অ্যাকাউন্ট থেকে নিজেদের বাদ দিয়ে বিরতি নেওয়ার পরামর্শ দিই।
              স্ব-বর্জন আপনার অ্যাকাউন্টটি ন্যূনতম 6 মাসের জন্য লক করবে এবং কোনও
              প্রচারমূলক সামগ্রী পাঠানো হবে না।
            </p>
            <p>
              এই অনুরোধ করতে যে কোনো সময়ে আমাদের অভিজ্ঞ গ্রাহক সহায়তা দলের
              সাথে যোগাযোগ করুন এবং তারা আপনাকে সাহায্য করবে। একটি 7 দিনের কুলিং
              অফ পিরিয়ডও উপলব্ধ। আমরা সুপারিশ করি যে আপনি অন্য সব জুয়া খেলার
              সাইটে যোগাযোগ করুন যেখানে আপনার অ্যাকাউন্ট আছে এবং সেখানেও
              স্ব-বর্জনের অনুরোধ করুন।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7">
            কম বয়সী জুয়া
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              সাইটের নামে খেলার জন্য খেলোয়াড়দের তাদের এখতিয়ারে (কমপক্ষে 18+)
              আইনি জুয়া খেলার বয়স হতে হবে। তারা যেখানে থাকেন এবং খেলা করেন সেই
              বয়সের সীমাবদ্ধতা সম্পর্কে সচেতন হওয়া এবং সাইটের নামে একটি
              অ্যাকাউন্ট তৈরি করার সময় তাদের বৈধতা নিশ্চিত করা তাদের দায়িত্ব।
              আমরা পিতামাতাদের নিম্নলিখিতগুলি করার পরামর্শও দিই:
            </p>

            <ol className="list-disc list-inside text-white">
              <li>পাসওয়ার্ড কম্পিউটার, মোবাইল এবং/অথবা ট্যাবলেট রক্ষা করে।</li>
              <li>
                আপনার অ্যাকাউন্টে লগ ইন করার সময় ডিভাইসটিকে অযত্নে রাখবেন না।
              </li>
              <li>
                নিশ্চিত করুন যে সমস্ত অ্যাকাউন্টের বিবরণ এবং ক্রেডিট কার্ডগুলি
                শিশুদের কাছে অ্যাক্সেসযোগ্য নয়৷
              </li>
              <li>
                আপনার কম্পিউটারে পাসওয়ার্ড সংরক্ষণ করবেন না, সেগুলি লিখে রাখুন
                এবং নাগালের বাইরে কোথাও রাখুন৷
              </li>
              <li>
                অপ্রাপ্তবয়স্কদের অনুপযুক্ত সাইট অ্যাক্সেস করা থেকে বিরত রাখতে
                ফিল্টারিং সফ্টওয়্যার (যেমন নেট ন্যানি) ডাউনলোড করুন৷
              </li>
            </ol>
          </div>
        </div>
      </div>
    </div>
  );
};

export default ResponsibleGameing;
