const Security = () => {
  return (
    <div className="h-auto">
      <div className="md:max-w-6xl mx-auto px-6 md:px-0 py-6 text-white flex flex-col text-center gap-6">
        <div>
          <h1 className="text-textSecondaryColor text-2xl mb-7 uppercase">
            {import.meta.env.VITE_SITE_NAME} নিরাপত্তা
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আপনার তথ্য আমাদের কাছে নিরাপদ থাকে তা নিশ্চিত করার জন্য আমরা
              সর্বাধিক উপলব্ধ উপায়গুলি বজায় রাখি। সমস্ত তথ্য এনক্রিপশন
              প্রযুক্তি ব্যবহার করে স্থানান্তরিত করা হয় এবং একবার আমাদের
              সার্ভারে সংরক্ষণ করা হলে, এটি আজকের উপলব্ধ সর্বশেষ ফায়ারওয়াল
              প্রযুক্তি ব্যবহার করে নিরাপদ রাখা হয়। আমাদের ওয়েব সাইট এবং
              সফটওয়্যার উভয়ই ডেটার নির্ভুলতা এবং গোপনীয়তা বজায় রাখার জন্য
              এবং আপনার ডেটা অপব্যবহার এবং/অথবা হারিয়ে যাওয়া থেকে রক্ষা করার
              জন্য সমস্ত উপলব্ধ উপায় ব্যবহার করে।
            </p>

            <p>
              আপনার যদি ডেটা গোপনীয়তা এবং নিরাপত্তা সংক্রান্ত অন্য কোন প্রশ্ন
              বা উদ্বেগ থাকে তবে দয়া করে আমাদের গ্রাহক সহায়তার সাথে যে কোন
              সময়, দিনে 24 ঘন্টা এবং সপ্তাহে 7 দিন যোগাযোগ করতে দ্বিধা করবেন
              না। আমাদের কাস্টমার সাপোর্ট প্রতিনিধিরা আপনাকে সাহায্য করতে পেরে
              বেশি খুশি হবেন।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            কুকিজ নীতি
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              {import.meta.env.VITE_SITE_NAME} – এর লক্ষ্য হল আপনাকে সর্বদা
              সর্বোত্তম পরিষেবা এবং ব্যবহারকারীর অভিজ্ঞতা প্রদান করা। এটি প্রদান
              করার আমাদের উপায়গুলির মধ্যে একটি হল কুকিজ ব্যবহার করা।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            একটি “কুকি” কি?
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              একটি কুকি, যা ব্রাউজার বা ট্র্যাকিং কুকি নামেও পরিচিত, একটি ওয়েব
              সার্ভারের পাঠানো তথ্যের একটি ছোট অংশ একটি ওয়েব ব্রাউজারে পাঠায়
              যা সার্ভারকে ব্রাউজার থেকে তথ্য সংগ্রহ করতে সক্ষম করে। যখন আপনি
              একটি নির্দিষ্ট ওয়েবসাইট লোড করেন, কুকিজ তৈরি হয় এবং প্রত্যেকবার
              ব্যবহারকারী একই ওয়েবসাইটে ফিরে গেলে, ব্রাউজারটি পুনরুদ্ধার করে
              এবং সংগৃহীত তথ্য ওয়েবসাইটের সার্ভারে পাঠায়।
            </p>

            <p>
              কুকিজ ব্যবহারকারীদের তাদের ওয়েবসাইটগুলি দক্ষতার সাথে নেভিগেট করতে
              এবং নির্দিষ্ট ফাংশন সম্পাদন করতে সাহায্য করার জন্য ব্যবহৃত হয়।
              ব্যবহারযোগ্যতা বা সাইট প্রসেস বাড়ানোর/সক্ষম করার মূল ভূমিকার
              কারণে, কুকিজ নিষ্ক্রিয় করা ব্যবহারকারীদের ওয়েবসাইটের নির্দিষ্ট
              ফাংশন ব্যবহার করতে বাধা দিতে পারে।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            {import.meta.env.VITE_SITE_NAME} কিভাবে কুকিজ ব্যবহার করে
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              সাধারণত, {import.meta.env.VITE_SITE_NAME} ব্যবহারকারীর অভিজ্ঞতা
              উন্নত করতে কুকি ব্যবহার করে। আপনাকে আরও ভাল দৃষ্টিভঙ্গি এবং বোঝার
              জন্য, আমরা আমাদের ওয়েবসাইটে কীভাবে কুকিজ ব্যবহার করা হয় তা নীচে
              সরবরাহ করেছি।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            ট্র্যাকিং এবং বিশ্লেষণ
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আমাদের ওয়েবসাইট পরিষেবাগুলিকে আরও উন্নত করতে ওয়েবসাইট ট্রাফিক
              বিশ্লেষণ করতে কুকিজ ব্যবহার করা হয়।
            </p>
            <p>
              {import.meta.env.VITE_SITE_NAME} অ্যাফিলিয়েট প্রোগ্রামের জন্য
              ব্যবহৃত তথ্য সংগ্রহ করতে ব্যবহৃত হয়।
            </p>

            <p>
              ব্যবহারকারীরা কীভাবে ওয়েবসাইটের ভিতরে চলে যান এবং দর্শকরা কীভাবে
              আমাদের সাইট ব্যবহার করে সে সম্পর্কে তথ্য সংগ্রহ করুন।{" "}
              {import.meta.env.VITE_SITE_NAME} এই তথ্য ব্যবহার করে রিপোর্ট
              কম্পাইল করে এবং আমাদের পরিষেবা উন্নত করতে সাহায্য করে।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            কার্যকারিতা
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              এটি আমাদের আপনাকে প্রত্যাবর্তনকারী দর্শনার্থী হিসেবে চিনতে এবং
              আপনার পছন্দের বিষয়বস্তু প্রদর্শন করতে দেবে।
            </p>
            <p>
              আমাদের প্রদত্ত পরিষেবার অভিজ্ঞতা বাড়িয়ে তুলতে ব্যবহার করা হয়।
            </p>

            <p>
              আমাদের দর্শকদের সহায়তা প্রদানের জন্য অনলাইন চ্যাট পরিষেবার জন্য
              কুকিজ ব্যবহার করা হয়।
            </p>
            <p>
              {import.meta.env.VITE_SITE_NAME} বিশেষ করে সেশন এবং ক্রমাগত কুকি
              ব্যবহার করে। সেশন কুকি যা সেশন লগআউটের পরে মেয়াদ শেষ হয়ে যায়
              এবং স্থায়ী হয় যা নির্দিষ্ট ধরনের কুকিজের উপর নির্ভর করে আপনার
              ব্রাউজারে এক মিনিট পর্যন্ত বছরের জন্য সংরক্ষণ করা যায়।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            কিভাবে কুকিজ পরিচালনা করবেন
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              আপনি আপনার ব্রাউজারের কনফিগার করতে পারেন যদি আপনি অক্ষম করতে চান,
              মুছে ফেলুন আপনার ব্রাউজারের গোপনীয়তা সেটিং মুছে ফেলা বা পরিবর্তন
              করে আপনার কম্পিউটারে কুকিজ সংরক্ষণ বন্ধ করুন। তবে দয়া করে মনে
              রাখবেন যে কুকিজ নিষ্ক্রিয় করা আমাদের দেওয়া কিছু পরিষেবা বা
              বৈশিষ্ট্যকে প্রভাবিত করতে পারে।
            </p>
          </div>
        </div>

        <div>
          <h1 className="text-textSecondaryColor text-xl mb-7 uppercase">
            {import.meta.env.VITE_SITE_NAME} অফিসিয়াল
          </h1>
          <div className="flex flex-col gap-3">
            <p>
              অনুগ্রহ করে লাইসেন্সবিহীন এবং অনিয়ন্ত্রিত সত্তা থেকে সতর্ক থাকুন
              যারা দূষিত উদ্দেশ্য নিয়ে {import.meta.env.VITE_SITE_NAME}{" "}
              ওয়েবসাইটের প্রতিলিপি করার চেষ্টা করছে। এই ভুয়া ওয়েবসাইটগুলি{" "}
              {import.meta.env.VITE_SITE_NAME}- এর সাথে কোনোভাবেই যুক্ত নয় এবং
              আমাদের নিয়ন্ত্রণ ও সুরক্ষার বাইরে। সর্বোচ্চ নিরাপত্তার মানগুলির
              জন্য, শুধুমাত্র অফিসিয়াল {import.meta.env.VITE_SITE_NAME}{" "}
              ওয়েবসাইটে খেলুন। আরও তথ্যের জন্য, ______ দেখুন।
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Security;
