import Container from "@/components/shared/Container";
import SiteInfoTabPanelContent from "@/components/siteInfo/SIteInfoTabPanelContent";
import { Tab, TabList, TabPanel, Tabs } from "react-tabs";
import "react-tabs/style/react-tabs.css";

const SiteInfo = () => {
  const tabsData = [
    {
      label: "আমাদের সম্পর্কে",
      contentData: {
        title: "আমাদের সম্পর্কেঃ",
        sections: [
          {
            heading: `${import.meta.env.VITE_SITE_NAME} বিবরণঃ`,
            text: `${
              import.meta.env.VITE_SITE_NAME
            } এশিয়ার একটি শীর্ষস্থানীয় অনলাইন গেম্বেলিং এবং বেটিং এর ব্র্যান্ড। আমদের মূল ফোকাস হচ্ছে ক্রিকেট,সকার এবং টেনিসের উপর বেটিং এক্সচেঞ্জ অফার করা, যা আমাদের মূল্যবান খেলোয়াড়দের প্রতিদিন শত শত মার্কেটে অন্য খেলোয়ারদের বিরুদ্ধে দুর্দান্ত সব অডস্‌ এ বেট ধরার সুযোগ দেয়! এছাড়াও, আমরা স্লট গেইমস, লাইভ ক্যাসিনো, পোকারসহ আরও অনেক আকর্ষণীয় অনলাইন গেইম সরবরাহ করে থাকি।
            \n ${
              import.meta.env.VITE_SITE_NAME
            } তে, আমরা আমাদের খেলোয়াড়দের সর্বোচ্চ গেমিংয়ের অভিজ্ঞতা উপভোগ করতে নিরাপদ, স্থিতিশীল, ন্যায্য এবং নির্ভরযোগ্য খেলার পরিবেশ তৈরি করতে প্রতিশ্রুতিবদ্ধ।`,
          },
          {
            heading: "নিরাপদ এবং অনন্য পরিবেশঃ",
            text: `${
              import.meta.env.VITE_SITE_NAME
            } বিশ্বের শীর্ষস্থানীয় নেটওয়ার্ক সিকিউরিটি সিস্টেম ব্যবহার করে এবং আপনার সমস্ত লেনদেনের পাশাপাশি আপনার ব্যক্তিগত তথ্যের গোপনীয়তা সুরক্ষিত রাখতে ১২৮-বিট এনক্রিপশন সহ সর্বোচ্চ মানের সুরক্ষা ব্যবস্থা নিশ্চিত করে। আমরা আপনার সমস্ত তথ্য কঠোরভাবে গোপনীয় ও সুরক্ষিত রাখার এবং আমাদের গোপনীয়তার নীতিমালা ব্যতীত কোনও তৃতীয় পক্ষের কাছে এসব তথ্য কখনই বিক্রি না করার প্রতিশ্রুতি দিচ্ছি।`,
          },
          {
            heading: "কাস্টমার কেয়ার সার্ভিসঃ",
            text: `আমাদের উচ্চ প্রশিক্ষন প্রাপ্ত কাস্টমার সাপোর্ট দলটি পরিপূর্ণ দক্ষতা ও গভীর আন্তরিকতার সহিত আপনাদের সকল প্রশ্নের উত্তর দিতে এবং সমস্যার সমাধান করতে, প্রতিদিন ২৪ ঘন্টা, সপ্তাহে ৭ দিনই সার্ভিস প্রদান করে থাকে।`,
          },
        ],
      },
    },
    {
      label: "প্রাইভেসি পলিসি",
      contentData: {
        title: "প্রাইভেসী পলিসি/গোপনীয়তার নীতি",
        sections: [
          {
            text: `আপনার যে কোন প্রাইভেসী বা গোপনীয়তা আমাদের জন্য গুরুত্বপূর্ণ, এবং আমরা আপনার ব্যক্তিগত তথ্য সুরক্ষিত রাখতে প্রতিশ্রুত। আপনার ব্যক্তিগত তথ্য আমরা কেন সংগ্রহ করি এবং আমরা এটি কীভাবে ব্যবহার করি সে সম্পর্কে আমরা আপনাদের নিকট স্বছ এবং জবাবদীহিতার নীতি অবলম্বন করব। যেখানে যেটুকু অধিকার মোতাবেক আপনি জানতে চান, আপনার প্রাইভেসীর সেটুকু আমরা আপনাকে জানাব।\n আমাদের ওয়েবসাইটের কোন কিছু ব্রাউজ বা চালনা করার সময় কীভাবে একজন ব্যবহারকারীর ব্যক্তিগত তথ্য ${
              import.meta.env.VITE_SITE_NAME
            } ব্যবহার করে সে সম্পর্কে যাবতীয় তথ্য এই প্রাইভেসী বা গোপনীয়তা নীতিটি দিয়ে থাকে।\n আমাদের প্রাইভেসী নীতিমালা আপনার সতঃস্বিদ্ধ মনে না হলে বা আপনি এই নীতিমালার সাথে আগ্রহী না হলে আমরা আপনাকে অনুগ্রহপূর্বক আমাদের ওয়েবসাইটের যে কোন অংশ ব্রাউজ/চালনা না করার পরামর্শ দিচ্ছি। আমরা আপনার সতর্ক্তামূলক দৃষ্টি আকর্ষণ করে জানাচ্ছি যে, আমাদের ওয়েবসাইটে একাউন্ট রেজিস্ট্রেশন/সাইন আপ, বেট প্লেসমেন্ট/ বেট ধরা এবং ফান্ড ট্রান্সফার বা যে কোন প্রকারের আর্থিক লেনদেন সংক্রান্ত ঘটনাসমূহকে আমাদের প্রাইভেসী নীতিমালার সাথে আপনার সম্মতিসূচক অবস্থান হিসেবে বিবেচিত এবং ব্যক্তিক সহাবস্থান হিসেবে গণ্য করা হবে। আপনি যে কোনও সময় ওয়েবসাইটটি ব্যবহার না করার অধিকার রাখেন; তবুও, আমাদের আইনীভাবে এখনও আপনার কিছু ব্যক্তিগত তথ্য ডাটাবেসে সংরক্ষিত অবস্থায় থাকবে।\n পর্যায়ক্রমিকভাবে এই প্রাইভেসী পলিসি সংশোধিত অথবা পরিমার্জিত হতে পারে এবং আমাদের প্ল্যাটফর্মগুলিতে পরিবর্তিত নীতিমালা সম্পর্কে পোস্ট করে আপনাদের এই পরিবর্তনগুলি সম্পর্কে জানিয়ে দেয়া হবে। আমরা এই প্রাইভেসী পলিসিটি আপনাকে নিয়মিতভাবে পুনঃপুর্নবার চেক করে দেখার পরামর্শ দিচ্ছি।`,
          },
          {
            heading: "কারা আপনার তথ্য নিয়ন্ত্রণ করছেন?",
            text: `এই প্রাইভেসি পলিসির মধ্য দিয়ে ${
              import.meta.env.VITE_SITE_NAME
            } এর সকল সহযোগী সংগঠন, প্রতিনিধি এবং অ্যাফিলিয়েট ( একযোগে সবাই, "আমরা" বা "আমাদেরকে" "আমাদের") আপনার ব্যক্তিগত তথ্যগুলো সংগ্রহের মাধ্যমে এবং যে উদ্দেশ্যে আপনার ব্যক্তিগত ডেটা ${
              import.meta.env.VITE_SITE_NAME
            } দ্বারা ব্যবহার করা হয়, এবং ইউরোপীয় তথ্য সংরক্ষণ আইন মোতাবেক প্রযোজ্য হবার লক্ষ্যে এবং পরিকল্পে একযোগে আপনার "তথ্য নিয়ন্ত্রক" হিসেবে কাজ করে।`,
          },
          {
            heading: "আমাদের তথ্য সংরক্ষণ কর্মকর্তাঃ",
            text: `তথ্য নিয়ে আপনার উদ্বেগ থাকলে অথবা আপনার তথ্য ${
              import.meta.env.VITE_SITE_NAME
            } কিভাবে নিয়ন্ত্রণ করে সে ব্যাপারে জানতে চাইলে আমাদের তথ্য সংরক্ষণ কর্মকর্তার নিকট আপনি যোগাযোগ করতে পারেন এই ঠিকানায় - info@${
              import.meta.env.VITE_SITE_NAME
            }.live.`,
          },
          {
            heading: "আমাদের কর্তৃক সংগৃহীত আপনার তথ্যঃ",
          },
          {
            heading: "ব্যক্তিকে চিহ্নিতকরণে তথ্যাদি",
            text: `একাউন্ট সেটিং এর সময়, বেট ধরা অথবা ওয়েবসাইটের যে কোন সার্ভিস ব্যবহারের সময় আপনি নিজেই এই ব্যক্তিগত তথ্য আমাদের দিয়ে থাকেন। ওয়েবসাইট সংক্রান্ত কিছু স্থান প্রবেশের সময় এই তথ্য-উপাত্তের দরকার হয়। তথ্যগুলো সংগৃহীত হয় যখনঃ \n• ${
              import.meta.env.VITE_SITE_NAME
            } এ একাউন্ট খোলা হয়;\n• ওয়েবসাইটে চালনার ক্ষেত্রে স্বেচ্ছায় প্রদানের মাধ্যমে;\n• ওয়েবসাইটের কোন পাব্লিক অংশে ব্যক্তিগতভাবে কেউ তার ব্যক্তিগত তথ্যাদি শেয়ার করলে,এবং আমাদের কাস্টমার সাপোর্ট টিমের সাথে যোগাযোগের সময় এটি সরবরাহ করুণ\n• আপনার ব্যাপারে যে তথ্যাদি সংগৃহীত হয়েছে তা হলোঃ\n• ইউজারনেম/ব্যাবহারকারীর নাম;\n• নামের প্রথম অংশ এবং ডাকনাম;\n• ই-মেইল ঠিকানা;\n• চিঠি-পত্রাদি প্রেরণের ঠিকানা;\n• ফোন নাম্বার;\n• বিল পরিশোধ ঠিকানা;\n• সনাক্তকরণের দলিল;\n• ঠিকানা সত্যয়নের প্রমাণাদি;\n• লেনদেনের ইতিহাস;\n• ওয়েবসাইট ব্যবহারের পছন্দসূচকগুলো;\n• ওয়েবসাইট ব্যবহারের সময় প্রদানকৃত অন্যান্য তথ্যাদি; এবং\n• ক্রেডিট/ডেবিট কার্ড সংক্রান্ত তথ্যাদি, অথবা অন্যান্য আর্থিক তথ্যসমূহ\n\nএই তথ্যগুলো বিলিং বিষয়ে এবং ক্ষুদ্র গোষ্ঠীর নিরাপত্তার স্বার্থে দরকার হয়। আমাদের কাস্টমার সাপোর্টে যোগাযোগ করে আপনি এই তথ্য সংশোধন এবং পরিবর্তন করতে পারেন। এই যাবতীয় তথ্যাদি অভ্যন্তরীণ কাজে ব্যবহার করা হয় এবং জড়িতরা ছাড়া কখনো কোন তৃতীয় পক্ষকে হস্তান্তর করা হয় না।`,
          },
          {
            heading: "টেলিফোন কলসমূহ",
            text: `কোন সেবা গ্রহণের ক্ষেত্রে আমাদের কাস্টমার সার্ভিসে কল প্রদান বা সেখান থেকে কোন কল গ্রহণের সময় সেই কলের গুরুত্ব এবং যাবতীয় নিরাপত্তার স্বার্থে উক্ত কলের কথপোকথন সংরক্ষণ করে রাখা হয়।`,
          },
          {
            heading: "আমাদের সেবার সামাজিক দিক",
            text: `আপনি আমাদের সেবার যে কোন সামাজিক মাধ্যমে অংশগ্রহণের সময় (যেমন- চ্যাট রুম) ${
              import.meta.env.VITE_SITE_NAME
            } আপনার তথ্যাদি সংরক্ষণ এবং তার ব্যবহার করে থাকে।`,
          },
          {
            heading: "অ-ব্যক্তিক তথ্যের চিহ্নিতকরণ এবং ট্রাফিক বিশ্লেষণ",
            text: `ব্যবহারকারীদের যথাসম্ভব বন্ধুত্বপূর্ণ ওয়েবসাইট সেবা মান প্রদানে ${
              import.meta.env.VITE_SITE_NAME
            } সদা সচেষ্ট। আপনি ওয়েবসাইট কোন পদ্ধতি মেনে ব্যবহার করেন এবং কোনটা এড়িয়ে যান সে ব্যাপারে ${
              import.meta.env.VITE_SITE_NAME
            } তথ্য সংগ্রহ করে। আপনি ওয়েবসাইটের সেবা গ্রহণের সময় আমাদের সার্ভার কিছু ব্যবস্থাপক সংক্রান্ত এবং ট্রাফিক তথ্যাদি সংগ্রহ করে রাখে যেমন যেমন- আই.পি ঠিকানা, প্রবেশের সময়, প্রবেশের তারিখ, যতগুলো ওয়েব পেইজ পরিদর্শন করা হয়েছে তার সংখ্যা, ভাষার ব্যবহার, ব্রাউজার টাইপ এবং সফটওয়্যার ক্রাশ সংক্রান্ত তথ্যাদি। এই তথ্যগুলো আমাদের সেবা মান এবং শর্তাদির জন্য দরকারী।`,
          },
          {
            heading: "কুকিজ",
            text: `যথাযথভাবে ওয়েবসাইট ব্যবহারের উদ্দেশ্যে এবং ওয়েবসাইটে ভিজিটিং বাড়াতে ${
              import.meta.env.VITE_SITE_NAME
            } কুকিজের ব্যবহার করে।`,
          },
          {
            heading: "কিভাবে এবং কেন আমরা আপনার ব্যক্তিগত তথ্যগুলো ব্যবহার করি",
            text: `যে ক্যাটাগরিগুলোতে আমরা আপনার ব্যক্তিগত তথ্যগুলো ব্যবহার করি সেগুলো হলোঃ\n• আপনার অনুরোধের কোন সেবা প্রদানের জন্য;\n• আমাদের আইনী দায়বদ্ধতাগুলো মেনে চলতে;\n• আমাদের ওয়েবসাইট কার্যকারিতা এবং মান যাচাই করতে;\n• আপনাদের মার্কেটিং সংক্রান্ত যাবতীয় তথ্যাদি প্রদানে\n\nআপনার ব্যক্তিগত তথ্যের উপর আপনার অধিকার কোন কোন ক্ষেত্রে আইনত স্বতঃসিদ্ধ হয় না। এই সেকশন প্রত্যেক ক্ষেত্র সম্পর্কে আরও বিশদ তথ্য দেয়, কতটুকু অধিকার প্রদান করে তা ব্যাখ্যা করে এবং কিভাবে এই অধিকার প্রয়োগ করতে হয় সে সম্পর্কে ধারণা দেয়। প্রত্যেক ক্ষেত্রেই এই অধিকার গুলো যথাযথভাবে মেনে চলা হয়।`,
          },
          {
            heading: "আমাদের সেবাসামগ্রী সরবরাহকরণ",
            text: `আমরা আপনার ব্যক্তিগত তথ্যগুলো নেই আপনাকে আপনার একাউন্টটি আমাদের ওয়েবসাইটে সেট আপ করতে এবং স্পোর্টস বুক, ক্যাসিনো এবং স্লট ব্যবহারে সহযোগিতা করতে।\nআমাদের সেবা সঠিকভাবে সরবরাহের জন্য আমরা আপনার তথ্যাদি আপনার গোপনীয়তা রক্ষা করে বহিরাগত সংস্থার সাথে শেয়ার করি যেন পরবর্তী এই শেয়ারিং তথ্যাদি থেকেও খুজে পাওয়া সম্ভব।\nএতে করে সাইন আপ করার পরে আমরা আপনাকে সফলভাবে সার্ভিস দিতে সক্ষম হই। আপনি যদি এই দাপ্তরিক চর্চায় আপত্তি করেন সেক্ষেত্রে আপনার একাউন্টটি বন্ধ করে ওয়েবসাইটের সার্ভিস গ্রহণ থেকে বিরত থাকার জন্য আপনাকে আহ্বান করা যাচ্ছে।\nবেটিং সংক্রান্ত দায়বদ্ধতা এবং এ জাতীয় মৌলিক ব্যব্যহার সুরক্ষিত রাখবার জন্য ${
              import.meta.env.VITE_SITE_NAME
            } আপনার ব্যক্তিগত তথ্য এবং ঠিকানা সংক্রান্ত দলিল শনাক্ত এবং ব্যবহার করে থাকে।\nব্যবসায়িক চুক্তি এবং শর্তের বাইরে যায় বা যে কোন আইনত বিষয়ে দরকার হলে আমরা চাইলে আপনার সত্যায়িত তথ্যগুলো যে কোন সময় পর্যবেক্ষণপূর্বক বৈধতা দান করতে পারি। এই পর্যবেক্ষণ শুধুই কোন ক্রেডিট রিপোর্ট না দিয়ে সুরক্ষিত উপায়ে পর্যালোচনা করে এবং/অথবা তৃতীয় পক্ষের বিপরীতে আপনার সরবরাহকৃত তথ্যের সত্যতা যাচাই-বাছাই করে।`,
          },
          {
            heading: "আমাদের ওয়েবসাইটের সেবা মান নিরীক্ষণে",
            text: `উপরে যেভাবে বলা হয়েছে যে, আমাদের সরবরাহকৃত যে কোন সেবার মান এবং এর স্বতঃস্ফূর্ত ব্যবহার নিশ্চিত করার জন্য আমরা কুকিজ এবং ট্রাফিক এনালাইসিস প্রয়োগ করি। এর বিনিময়ে আমাদের কিছু বৈধ সুবিধা নিহিত রয়েছে তাই আপনার ব্যক্তিগত তথ্যগুলো আক্রান্ত হবার ঝুঁকি কমিয়ে এনেই আমরা এই কাজটি সম্পন্ন করে থাকি।\nআমাদের বৈধ সুবিধা আনয়ন প্রকৃয়ায় আপনার "আপত্তি জানানোর অধিকার" আছে যদি আপনি মনে করেন যে আপনার ব্যক্তিগত তথ্যের ব্যবহার আমাদের ব্যবসায়িক স্বার্থ রক্ষার সীমার বাইরে গিয়ে চর্চা হচ্ছে। যদিওবা এই সামগ্রিক কার্যকলাপ আমাদের ব্যবসায়িক পরিধির কেন্দ্র থেকে নিয়ন্ত্রিত এবং সরাসরি কেন্দ্রকে প্রভাবিত করে তবুও আপনি অভিযোগ জানাতে চাইলে তা গ্রহণযোগ্য এবং সেক্ষেত্রে আপনার কুকিজগুলো ম্যানেজ করার উদ্যোগ গৃহীত হবে অর্থ্যাৎ পরিচালিত একাউন্টটি সমূলে বন্ধ করে দেবার দরকার হতে পারে।`,
          },
          {
            heading: "মার্কেটিং",
            text: `আপনারা আমাদের এটা করার অনুমতি দিলে আমরা ই-মেইল, এস.এম.এস অথবা অন্য কোন অনলাইন মিডিয়ামে আপনাদের অফার এবং প্রমোশনগুলো পাঠাব।\nআপনি এই প্রদত্ত সম্মতি যে কোন সময় পরিত্যাগ অথবা পরিমার্জন করবার অধিকার সংরক্ষণ করেন।`,
          },
          {
            heading: "আপনার অধিকার সমুহঃ",
          },
          {
            heading: "আপনার সংশোধনের অধিকার",
            text: `আপনার ব্যক্তিগত তথ্যগুলো ভুলভাবে লিপিবদ্ধ থাকলে আপনি তা যথাসম্ভব সংশোধন করার অধিকার সংরক্ষণ করেন। আপনার ব্যক্তিগত তথ্যগুলোর কোন একটি যদি "মাই একাউন্ট" এ গিয়ে সংশোধনযোগ্য না হয় তবে অনুগ্রহপূর্বক সরাসরি info@${
              import.meta.env.VITE_SITE_NAME
            }.live এ যোগাযোগ করুন।`,
          },
          {
            heading: "আপনার ব্যক্তিগত তথ্যাদির একটি কপি দরখাস্তের অধিকার",
            text: `আপনি যদি আপনার ব্যক্তিগত তথ্যাদির একটি কপি আমাদের কাছে দরখাস্তের আবেদন জানান তাহলে আমরা তা আপনাকে সরবরাহ করব। আপনাকে শুধু আমাদের লাইভ চ্যাট করলেই চলবে অথবা info@${
              import.meta.env.VITE_SITE_NAME
            }.live এ ই-মেইল করতে হবে এবং পরবর্তীতে আপনাকে এই দরখাস্তের সাপেক্ষে একটি ভেরিফিকেশন ফর্ম পূরণ মারফৎ আপনার তথ্যাদি সংশোধন করিয়ে নিতে পারবেন। এই ফর্ম পূরণ বাধ্যতামূলক না তবে এটা আমাদের দ্রুত এবং স্বল্পতম সময়ে আপনার তথ্যাদি সংশোধনে সহায়ক হয়। আপনার ব্যক্তিগত তথ্যাদি নিরাপদ রেখে আমরা আপনার কাছে আপনার ব্যক্তিগত একাউন্টটির সনাক্তকরণে যাবতীয় সনাক্তসূচক প্রমাণ চাইব। এই প্রমাণাদি পেশ করার এক মাসের মধ্যে আমরা আপনার দরখাস্তের জবাব প্রদান করব এবং উল্লেখ্য যে এই জবাব আমরা যত দ্রুত সম্ভব আপনাকে জানাব এবং এর কার্যকলাপ সম্পন্ন হবার সম্ভাব্য সময় এবং ব্যবস্থাপনা খরচ (যদি থাকে) জানিয়ে দিব।`,
          },
          {
            heading: "আপনার মুছে ফেলার অধিকার",
            text: `কিছু বাধ্যবাধকতা ছাড়া আপনি আপনার যে কোন ব্যক্তিগত তথ্য যে কোন সময় মুছে ফেলার জন্য আমাদের আবেদন জানাতে পারেন। কিছু সুনির্দৃষ্ট ক্যাটাগরিতে এই অধিকার আপনি চর্চা করতে পারবেন তবে এটি মোটেও প্রতিশ্রুত এবং চিরন্তন কোন অধিকার হিসেবে সাব্যস্ত না।\nউল্লেখিত যে কোন বিষয়ের ক্ষেত্রে কার্য ক্রিয়াদি চলমান থাকা অবস্থায় মুছে ফেলার অধিকারটি ব্যবহারকারীর জন্য প্রয়োগযোগ্য হিসেবে প্রযোজ্য হবে নাঃ বাক-স্বাধীনতা প্রকাশের কোন অধিকার প্রয়োগ করলে; কোন আইনি দায় মেনে চললে; গণস্বার্থে কোন কার্যক্রম জারি থাকলে অথবা দাপ্তরিক কর্তৃপক্ষের দ্বারা কোন অনুশীলন চলমান থাকলে; গণস্বার্থ অর্জনের উদ্দেশ্যে নিয়োজিত থাকলে; ঐতিহাসিক, বৈজ্ঞানিক এবং পারিসাংখ্যিক কোন গবেষণা জারি থাকলে যদি সেখানে সেই নির্দৃষ্ট তথ্য মুছে ফেলা অসম্ভব হয়ে থাকে বা তা মুছে ফেলার কোন বড় প্রভাব থেকে থাকে; অথবা *প্রতিষ্ঠা, অনুশীলন কিংবা কোন আইনি নোটিশ বা অভিযোগের জন্য।`,
          },
          {
            heading: "আপনার ব্যক্তিগত তথ্যাদি শেয়ার করা",
            text: `আমরা আপনার ব্যক্তিগত তথ্যাদি তৃতীয় পক্ষকে দরকার হলে প্রকাশ করতে পারিঃ\n• যদি কোন আইনি দায় অথবা চুক্তিবদ্ধ শর্ত জারি থাকার কারণে আমাদের উপর আপনার ব্যক্তিগত তথ্যগুলো প্রকাশের দায়িত্ব ন্যস্ত হয়;\n• যে কোন চুক্তি বা নোটিশের শর্তাদি পূরণের দরকার হলে;\n• আপনাদের কোন আবেদন প্রক্রিয়াকরণে আমাদের তৃতীয় পক্ষের সাহায্যের দরকার হলে সীমিত পরিসরে তথ্যের প্রকাশ হতে পারে;\n• পেমেন্ট এবং গেইম প্রতারণার আওতার ভেতর এবং আওতা পেরিয়ে যদি আপনার কোন কাজে আমাদের সাথে প্রতারণা করার কোন ঘটনা ঘটে থাকে;\n• নেশা প্রতিরোধে বলবৎ কোন গবেষণার উদ্দেশ্যে দরকার হলে (এই তথ্যগুলো নামহীন আকারে প্রকাশিত হবে);\n• আমাদের, আমাদের ওয়েবসাইট ব্যবহারকারীদের এবং অন্যান্যদের যাবতীয় অধিকার, সম্পদ এবং নিরাপত্তা সংরক্ষিত রাখার তাগিদে এবং\n• যেখানে আমরা এই শেয়ারিং এর জন্য অনুমতিপ্রাপ্ত হব।\n\nসংগৃহীত ব্যক্তিগত তথ্যাদি যে কোন দেশে সংরক্ষণ এবং ব্যবহারযোগ্য হিসেবে পরিগণিত হবে যেখানে আমরা, আমাদের সরবরাহকারী, এফিলিয়েট এবং এজেন্টরা সুবিধা পাবেন। এই সার্ভিস ব্যবহারের একটি শর্ত স্বরুপ আপনি আপনার ব্যক্তিগত তথ্যাদি আপনার দেশের বাইরে ব্যবহৃত হবার ব্যাপারে সম্মতি দিয়েছেন। যখনই আপনার ব্যক্তিগত তথ্যাদির কোন কিছু আমরা বাইরে পাঠাই তখনই ইইএ বা অতিরিক্ত সতর্কতা অবলম্বন করি আপনার তথ্যের সার্বিক নিরাপত্তার স্বার্থে আর তাই সেখানে তথ্য ইইএ অথবা পর্যাপ্ত এখতিয়ারের আওতায় রাখা হয়। নির্দৃষ্ট সীমানার বাইরে থাকলেও কিছু এব্যাপারে কিছু অন্তর্ভুক্তি দ্রষ্টব্যঃ\nকর্পোরেট বিধিমালা বেধে দেওয়া;\n• আদর্শ চুক্তিপত্র; অথবা\n• আমেরিকান / ইউরোপীয়ান প্রাইভেসী শিল্ড`,
          },
          {
            heading: "সিকিউরিটি/নিরাপত্তা",
            text: `আমরা নিরাপত্তার গুরুত্ব বুঝি এবং তথ্য সংরক্ষণের কৌশল সম্পর্কে অবহিত আছি। আপনার থেকে আসা সব ব্যক্তিগত তথ্যগুলো এবং পাসওয়ার্ড আমরা এনক্রিপটেড এবং নিরাপদ নেটওয়ার্ক এর আওতায় সংরক্ষিত ডেটাবেজে স্টোর করি যেখানে নেপথ্যে state-of-the-art firewall সফটওয়্যার এর শক্তিশালী ব্যাক আপ থাকে। (আমাদের সেবা এস.এস.এল ভার্সন ৩ সাথে ১২৮ বিট এনক্রিপশন সাপোর্ট করে।) এছাড়াও আমরা, আমাদের সহযোগী কোম্পানি, এজেন্ট, এফিলিয়েট এবং সাপ্লায়ারদের তথ্যগত নিরাপত্তার সুবিধার্থে বিভিন্নমুখী ব্যবস্থা নিয়ে থাকি।`,
          },
          {
            heading: "ধারণ-ক্ষমতা",
            text: `আমাদের আইনী এবং ব্যবসায়িক প্রয়োজন মোতাবেক যতদিন দরকার ঠিক ততদিন আমরা ব্যবহারকারীর ব্যক্তিগত তথ্যগুলো সংরক্ষণ করি। তথ্য-উপাত্ত সংরক্ষণের মুহুর্তে ${
              import.meta.env.VITE_SITE_NAME
            } স্থানীয় আইন, চুক্তির বাধ্যবাধকতা এবং ব্যবহারকারীদের চাহিদা এবং প্রত্যাশাগুলো বিবেচনাধীন রাখে। আপনার ব্যক্তিগত তথ্যগুলোর সব ধরনের নিষ্পত্তি হয়ে গেলে এই তথ্য নিরাপদে ফেলে দেয়া হয়।`,
          },
          {
            heading: "তৃতীয় পক্ষের হস্তক্ষেপ",
            text: `আপনি কোন তৃতীয় পক্ষকে আপনার ব্যক্তিগত তথ্যগুলো সরবরাহ করলে আমরা সেই তথ্যের নিরাপত্তার গ্যারান্টি প্রদান করি না কারণ এই তৃতীয় পক্ষ তার নিজস্ব ব্যবসায়িক গণ্ডীর মধ্যে স্বতন্ত্র এবং স্বাধীন। আমাদের কাছে এই তৃতীয় পক্ষ থেকে কোন তথ্য এসে থাকলে আমরা তা আমাদের প্রাইভেসি পলিসি মোতাবেক পরিচালনা করি।\nআমাদের ওয়েবসাইট অন্য ওয়েবসাইটের লিঙ্ক থাকতে পারে যা কিনা আমাদের নিয়ন্ত্রণে না এবং আমাদের প্রাইভেসি পলিসি দ্বারাও নিয়ন্ত্রিত না। আপনি যদি ঐ সমস্ত লিঙ্ক এ প্রবেশ করেন তাহলে সেই লিংক এর অপারেটর কোম্পানি আপনার ব্যক্তিগত তথ্যাদি সংগ্রহের সুযোগ পাবেন এবং তারা তা তাদের প্রাইভেসি পলিসি অনুসারে ব্যবহার করবেন যা কি-না আমাদের প্রাইভেসি পলিসি থেকে সাধারণভাবেই ভিন্নতর। তাই, লিংকড ওয়েবসাইটগুলোর সম্ভাব্য ভুলগুলোর ব্যাপারে এবং তাদের দায়িত্বে থাকা ফাংশনাল তথ্য ব্যবহারের নীতি স্বরুপ তারাই তার দায়ভার বহন করবে এবং এক্ষেত্রে আমরা কোন একক দায়ভার বহন করব না।`,
          },
          {
            heading: "কতক বিশ্লেষণ",
          },
          {
            heading: "গুগল বিশ্লেষণ (গুগল ইন.)",
            text: `গুগল বিশ্লেষণ বলতে মূলত গুগলের (গুগল ইন.) ইন্টারনেট সম্পর্কিত সেবাসমূহকে বোঝানো হয়ে থাকে। এই তথ্য-উপাত্ত গুগল ব্যবহার করে ${
              import.meta.env.VITE_SITE_NAME
            } এর তথ্যানুসন্ধান ও নীরিক্ষা, এর কার্যকলাপের খসড়া প্রস্তুত এবং অন্যান্য গুগল প্রজেক্টের সাথে শেয়ার করার নিমিত্তে।\nসংগৃহীত তথ্য-উপাত্ত গুগল প্রসঙ্গক্রমে ব্যবহার এবং নিজস্ব বিজ্ঞাপন নেটওয়ার্কিং এ প্রয়োগ করতে পারে।\nসংগৃহীত ব্যক্তিগত তথ্যাদিঃ কুকিজ এবং তথ্যের ব্যবহার`,
          },
          {
            heading: "দায় অস্বীকার",
            text: `সেবাটি কোন প্রকার দায় ছাড়া "AS-IS" এবং "AS-AVAILABLE" পরিচালনা করে থাকে। আমাদের সরাসরি নিয়ন্ত্রণ পেরিয়ে ঘটা কোন ঘটনা জন্য আমরা দায়বদ্ধ না। প্রযুক্তি এবং ব্যবসার এই জটিল এবং এই ক্রমাগত পরিবর্তিত স্বভাবের জন্য আমরা কোন গ্যারান্টি প্রদান করি না এবং আপনার ব্যক্তিগত তথ্যাদির নির্ভুল প্রয়োগের নিশ্চিত সম্ভাবনাও ঘোষণা দিতে পারি না এবং সাথে সাথে ব্যক্তিগত তথ্যাদির সাথে সংযুক্ত যে কোন পরোক্ষ, দৈবঘটনা, ধারাবাহিক অথবা শাস্তিমূলক ক্ষতির জন্য আমরা দায়বদ্ধ থাকব না।`,
          },
          {
            heading: "আমাদের নিরাপত্তা নীতিমালার সংশোধন এবং পরিবর্তন",
            text: `আমরা প্রাইভেসি পলিসি বা নিরাপত্তার নীতিমালা নিয়মিত নবায়ন করতে পারি তাই অনুগ্রহপূর্বক এটা নিয়মিত চোখ বোলাবেন।\nযদি এই প্রাইভেসি পলিসিতে কোন উল্লেখযোগ্য, বস্তুগত পরিবর্তন আসে আমরা সর্বসম্মতভাবে তা ই-মেইল, ওয়েবসাইট নোটিশ অথবা যে কোন সম্ভাব্য চ্যানেলে জানাতে সদাসক্রিয় থাকব। আমরা আগে থেকেই আপনাদের এই পরিবর্তন জানিয়ে দিব যেন আপনারা সেই পরিবর্তন সংক্রান্ত যে কোন প্রভবের ব্যাপারে আগে থেকেই স্পষ্ট ধারণা রাখতে পারেন।\nআপনাদের স্পষ্ট সম্মতি ছাড়া আমরা আমাদের প্রাইভেসি পলিসিতে কোন বস্তুগত পরিবর্তন আনব না। যদি আপনি প্রাইভেসি পলিসির কোন পরিবর্তন প্রত্যাখ্যান করতে চান কিংবা নির্দৃষ্ট সময়ের মধ্যেই পরিবর্তন গ্রহণ করা থেকে বিরত থাকেন; সেক্ষেত্রে হয়তো আমরা কিছু নির্দৃষ্ট সেবা প্রদানে সক্ষম হব না।`,
          },
        ],
      },
    },
    {
      label: "টার্মস এন্ড কন্ডিশন",
      contentData: {
        title: "টার্মস এন্ড কন্ডিশন",
        sections: [
          {
            heading: "সর্বশেষ আপডেট: ২৮শে এপ্রিল ২০২৫",
          },
          {
            heading: "১. ভুমিকা",
            text: `এই শর্তাবলী এবং নীচে উল্লেখিত দলিলগুলি ("শর্তাবলী") বর্তমান ওয়েবসাইট ("ওয়েবসাইট") এবং এর সম্পর্কিত বা সংযুক্ত পরিষেবাগুলির (সম্মিলিতভাবে, "পরিষেবা") ব্যবহারের ক্ষেত্রে প্রযোজ্য।\nআপনার এই শর্তাবলী সাবধানতার সাথে পর্যালোচনা করা উচিত কারণ এতে ওয়েবসাইট ব্যবহারের বিষয়ে আপনার অধিকার এবং বাধ্যবাধকতা সম্পর্কিত গুরুত্বপূর্ণ তথ্য রয়েছে এবং আপনার - আমাদের গ্রাহক ("গ্রাহক") এবং আমাদের মধ্যে একটি বাধ্যতামূলক আইনি চুক্তি তৈরি করা উচিত। এই ওয়েবসাইটটি ব্যবহার করে এবং/অথবা পরিষেবা অ্যাক্সেস করার মাধ্যমে, আপনি, আপনি একজন অতিথি বা অ্যাকাউন্ট খোলার মাধ্যমে ("একাউন্ট") এবং যে কোন সময়ে প্রকাশিত হতে পারে এমন কোনও সংশোধনীর সাথে, এই পরিষেবাটি ব্যবহার করে আপনি এই শর্ত দ্বারা আবদ্ধ হতে সম্মত। আপনি যদি এই শর্তাবলীগুলো গ্রহণ না করেন তবে আপনার পরিষেবাটি অ্যাক্সেস করা এবং ওয়েবসাইট ব্যবহার করা থেকে বিরত থাকা উচিত।\nসার্ভিসটি Aurora Holdings N.V.-এর মালিকানাধীন, কুরাকাও তে নিবন্ধিত একটি সীমিত দায়বদ্ধ সংস্থা, কোম্পানির রেজিস্ট্রেশন নাম্বার 10692, ) এবং নিবন্ধিত ঠিকানা হলঃ Abraham de Veerstraat 9, Willemstad, Curacao ("কোম্পানি", অনলাইন গেমের চান্সের জন্য গেমিং সার্ভিস প্রোভাইডার N.V. লাইসেন্স # 365/JAZ-এর অধীনে Curaçao-এ লাইসেন্সপ্রাপ্ত।`,
          },
          {
            heading: "২. সাধারণ শর্তাদি",
            text: `আমরা যেকোন সময় শর্তাদি সংশোধন করার অধিকার সংরক্ষণ করি (নিচে উল্লেখ করা এবং লিঙ্কযুক্ত যেকোনো দলিল সহ)। শর্তাবলী পর্যালোচনা করতে আপনাকে পর্যায়ক্রমে এই পৃষ্ঠাটি দেখতে হবে। এই ওয়েবসাইটে প্রকাশের সাথে সাথে সংশোধনগুলি বাধ্যতামূলক এবং কার্যকর হবে৷ আপনি যদি এই ধরনের কোনো পরিবর্তনে আপত্তি করেন, তাহলে আপনাকে অবিলম্বে পরিষেবাটি ব্যবহার বন্ধ করতে হবে। এই ধরনের প্রকাশনার পর আপনার ওয়েবসাইটের ক্রমাগত ব্যবহার আপনার চুক্তিকে সংশোধিত শর্তাবলী দ্বারা আবদ্ধ হওয়ার ইঙ্গিত দেবে। পরিবর্তিত শর্তাবলী কার্যকর হওয়ার পূর্বে সেটেল না করা যেকোনো বেট পূর্ব-বিদ্যমান শর্তাবলীর সাপেক্ষে হবে।`,
          },
          {
            heading: "৩. আপনার বাধ্যবাধকতা",
            text: `আপনি সর্বদা সম্মত যে ওয়েবসাইটটি অ্যাক্সেস করার সময় এবং পরিষেবাটি ব্যবহার করার সময়:\n৩.১. আপনার বয়স 18-বছরেরও বেশি , বা আপনার জন্য প্রযোজ্য আইন বা এখতিয়ারের অধীনে যে আইনি বয়সে জুয়া খেলা বা গেমিং কার্যকলাপ অনুমোদিত। আমরা যেকোনো সময় আপনার কাছ থেকে বয়স সংক্রান্ত ডকুমেন্ট প্রমাণপত্রের জন্য অনুরোধ করার অধিকার সংরক্ষণ করি।\n৩.২. আপনি আইনি ক্ষমতা সম্পন্ন এবং আমাদের সাথে একটি বাধ্যতামূলক আইনি চুক্তিতে প্রবেশ করতে পারেন। আপনি যদি আইনি ক্ষমতাসম্পন্ন না হন তবে আপনাকে অবশ্যই ওয়েবসাইট অ্যাক্সেস করতে বা পরিষেবাটি ব্যবহার করতে হবে না।\n৩.৩. আপনি জুয়া খেলার অনুমতি দেয় এমন একটি এরিয়ার বাসিন্দা। আপনি এমন কোনো দেশের বাসিন্দা নন যেখানে তার বাসিন্দাদের বা এই ধরনের দেশের মধ্যে কোনো ব্যক্তির কাছে অনলাইন জুয়া খেলার অ্যাক্সেস নিষিদ্ধ৷ এই পরিষেবাটি আপনার ব্যবহার এর জন্য বৈধ কিনা তা নিশ্চিত করা আপনার একমাত্র দায়িত্ব।\n৩.৪. আপনি VPN, প্রক্সি বা অনুরূপ সার্ভিস বা ডিভাইসগুলি ব্যবহার করতে পারবেন না যা আপনার আসল অবস্থানের সনাক্তকরণকে লুকায়িত করে বা ম্যানিপুলেট করে।\n৩.৫. আপনি যে পেমেন্ট মেথড ব্যবহার করেন তার অনুমোদিত ব্যবহারকারী আপনি নিজেই হতে হবে।\n৩.৬. আপনাকে অবশ্যই আমাদের সাথে আপনার করা পেমেন্টটি বিশ্বাসের সাথে করতে হবে এবং পেমেন্টকৃত অর্থকে ফিরিয়ে আনার চেষ্টা করবেন না বা এমন কোনো পদক্ষেপ গ্রহণ করবেন না যা এই জাতীয় পেমেন্টকে কোনো তৃতীয় পক্ষের দ্বারা প্রত্যাবর্তিত করবে।\n৩.৭. বেট রাখার সময় আপনি এই শর্তাবলী অনুসারে পরিষেবাতে ডিপোজিট করা আপনার কিছু বা সমস্ত অর্থ হারাতে পারেন এবং সেই ক্ষতির জন্য আপনি সম্পূর্ণরূপে দায়ী থাকবেন।\n৩.৮. বেট রাখার সময় আপনি যে দেশে বেট রাখার সময় ছিলেন সেই দেশে বলবৎ কোনো আইন লঙ্ঘন করে প্রাপ্ত কোনো তথ্য ব্যবহার করবেন না।\n৩.৯. আপনি অন্য কোনো পক্ষের পক্ষে বা কোনো বাণিজ্যিক উদ্দেশ্যে কাজ করছেন না, তবে ব্যক্তিগত ক্ষমতায় একজন ব্যক্তিগত ব্যক্তি হিসেবে আপনার নিজের পক্ষে কাজ করছেন।\n৩.১০. আপনি অবশ্যই খারাপ বিশ্বাসে বা পরিষেবার অখণ্ডতাকে বিরূপভাবে প্রভাবিত করে এমন কোনও উপায়ে পরিষেবার মধ্যে কোনও মার্কেট বা উপাদানকে হেরফের করার চেষ্টা করবেন না।\n৩.১১. আপনাকে অবশ্যই পরিষেবাটি ব্যবহার করে করা সকল বেট এবং আমাদের সাথে সর্বদা বিশ্বাসের কাজ করতে হবে।\n৩.১২. আপনি, বা, প্রযোজ্য হলে, আপনার কর্মচারী, নিয়োগকর্তা, এজেন্ট, বা পরিবারের সদস্যরা, আমাদের অ্যাফিলিয়েট প্রোগ্রামে অ্যাফিলিয়েট হিসাবে নিবন্ধিত হতে পারবেন না।`,
          },
        ],
      },
    },
    {
      label: "দায়িত্বশীল গেমিং",
      contentData: {
        title: "Responsible Gaming (দায়িত্বশীল গেমিং)",
        sections: [
          {
            heading: "দায়িত্ব সহকারে গেম্বলিং করা",
            text: `সর্বশেষ আপডেট: ২৮শে এপ্রিল ২০২৫\nআপনার নিজের সুবিধার জন্য অনুগ্রহপূর্বক এই তথ্যটি মনযোগ সহকারে পড়ুন।\nhttps://www.${
              import.meta.env.VITE_SITE_NAME
            }.live Aurora Holdings N.V..দ্বারা পরিচালিত হয়। Abraham de Veerstraat 9, Curacao এ তার অফিস রয়েছে। কোম্পানির রেজিস্ট্রেশন নম্বর 157258.`,
          },
          {
            heading: "নিরাপদ এবং অনন্য পরিবেশঃ",
            text: `${
              import.meta.env.VITE_SITE_NAME
            } বিশ্বের শীর্ষস্থানীয় নেটওয়ার্ক সিকিউরিটি সিস্টেম ব্যবহার করে এবং আপনার সমস্ত লেনদেনের পাশাপাশি আপনার ব্যক্তিগত তথ্যের গোপনীয়তা সুরক্ষিত রাখতে ১২৮-বিট এনক্রিপশন সহ সর্বোচ্চ মানের সুরক্ষা ব্যবস্থা নিশ্চিত করে। আমরা আপনার সমস্ত তথ্য কঠোরভাবে গোপনীয় ও সুরক্ষিত রাখার এবং আমাদের গোপনীয়তার নীতিমালা ব্যতীত কোনও তৃতীয় পক্ষের কাছে এসব তথ্য কখনই বিক্রি না করার প্রতিশ্রুতি দিচ্ছি।`,
          },
          {
            heading: "কাস্টমার কেয়ার সার্ভিসঃ",
            text: `আমাদের উচ্চ প্রশিক্ষন প্রাপ্ত কাস্টমার সাপোর্ট দলটি পরিপূর্ণ দক্ষতা ও গভীর আন্তরিকতার সহিত আপনাদের সকল প্রশ্নের উত্তর দিতে এবং সমস্যার সমাধান করতে, প্রতিদিন ২৪ ঘন্টা, সপ্তাহে ৭ দিনই সার্ভিস প্রদান করে থাকে।`,
          },
        ],
      },
    },
    {
      label: "18+",
      contentData: {
        title: "18+",
        sections: [
          {
            heading: "শুধুমাত্র ১৮ বছর বা তার বেশি বয়সী গ্রাহকদের জন্যঃ",
            text: `${
              import.meta.env.VITE_SITE_NAME
            } কেবল ১৮ বছর বা তার বেশি বয়সের গ্রাহকদের জন্য তৈরি করা হয়েছে। ১৮ বছরের কম বয়সী গ্রাহকের জন্যে ${
              import.meta.env.VITE_SITE_NAME
            } তে অ্যাকাউন্ট খোলা এবং / অথবা এ সাইটে গেম্বেলিং বা বেটিং করা অপরাধ হিসাবে বিবেচিত হবে। ${
              import.meta.env.VITE_SITE_NAME
            } তার সদস্যদের বয়স-যাচাই করে এবং কোম্পানীর নিজস্ব পদ্ধতিতে এই জাতীয় যাচাইকরণের অধিকার সংরক্ষণ করে। এ যাচাইকরন প্রক্রিয়া কোম্পানির দায়িত্বের মধ্যে পরে এবং ${
              import.meta.env.VITE_SITE_NAME
            } এটিকে খুব গুরুত্ব সহকারে বিবেচনা করে। প্রত্যেক সদস্য বয়স যাচাইকরণ শেষ না হওয়া পর্যন্ত আমাদের কোনও অর্থ প্রদানের পরিষেবা ব্যবহার করতে পারবেন না। আপনার বয়স যাচাইকরণ যদি পেন্ডিং থাকে তবে ${
              import.meta.env.VITE_SITE_NAME
            } আপনার অ্যাকাউন্ট স্থগিত করার অধিকার সংরক্ষণ করে।\nদ্রষ্টব্যঃ যদি ১৮ বছরের কম বয়সের কোনও সদস্য ${
              import.meta.env.VITE_SITE_NAME
            } ব্যবহার করে, তবে আমাদের কোম্পানী ব্যবহারকারীর খেলায় অর্জিত সমস্ত অর্থ বাজেয়াপ্ত করার এবং সংশ্লিষ্ট কর্তৃপক্ষকে রিপোর্ট করার অধিকার সংরক্ষণ করে।`,
          },
          {
            heading: "ফিল্টারিং সিস্টেমঃ",
            text: `${
              import.meta.env.VITE_SITE_NAME
            } সকল অপ্রাপ্ত বয়স্কদের যেকোনো ধরনের ই-গেইমিং ওয়েবসাইট এক্সেস করা হতে বিরত থাকতে দৃঢ়তার সঙ্গে উৎসাহিত করে এবং পরামর্শ দান করে।\nঅভিভাবকরা নির্দিষ্ট কাইটেরিয়ার ভিত্তিতে ফিল্টারিং সল্যুশনের মাধ্যমে সন্তানদের ইন্টারনেট অ্যাক্সেসকে নিয়ন্ত্রণ করতে পারে এবং অপ্রাপ্তবয়স্কদের ই-গেমিং ওয়েবসাইটগুলি অ্যাক্সেস করা থেকে বিরত রাখতে পারেন। ফিল্টারিং সল্যুশনগুলি আমাদের সাইটের কন্টেন্ট সনাক্ত করার পরে, ${
              import.meta.env.VITE_SITE_NAME
            } তে অ্যাক্সেস ডিনাই করতে পারে এবং এটি করতে পারে কারন আমরা আমাদের ওয়েবসাইটকে লেবেলিং করি। আপনার ডিভাইসটি যদি অপ্রাপ্ত বয়স্ক ফ্যামিলি মেম্বার এবং বন্ধুবান্ধবদের সাথে শেয়ার করা থাকে তবে আপনি ফিল্টারিং সল্যুশন ব্যবহারের মাধ্যমে তাদেরকে ${
              import.meta.env.VITE_SITE_NAME
            } তে এক্সেস করা থেকে বিরত রাখুন।`,
          },
        ],
      },
    },
    {
      label: "KYC",
      contentData: {
        title: "KYC (কেওয়াইসি)",
        sections: [
          {
            heading: `${import.meta.env.VITE_SITE_NAME} এর কেওয়াইসি পলিসি।`,
            text: `সর্বশেষ আপডেট: ২৮শে এপ্রিল ২০২৫\nযখন একজন ইউজার মোট জীবনকালে মোট ২০০০ ইউরোর বেশি ডিপোজিট করলে বা https://www.${
              import.meta.env.VITE_SITE_NAME
            }.live প্ল্যাটফর্মে যে কোনো পরিমাণ উইথড্র করতে রিকোয়েস্ট করে, তখন তাদের জন্য একটি সম্পূর্ণ কেওয়াইসি প্রক্রিয়া করা বাধ্যতামূলক।\nএই প্রক্রিয়া চলাকালীন, ইউজারকে কে নিজের সম্পর্কে কিছু মৌলিক বিবরণ ইনপুট করতে হবে এবং তারপর আপলোড করতে হবে\n১) সরকার কর্তৃক ইস্যু করা ছবি দেখা যায় এমন আইডির একটি কপি (কিছু তথ্যের ক্ষেত্রে সামনে এবং পিছনে ডকুমেন্টের উপর নির্ভর করে)\n২) আইডি ডকুমেন্ট ধরে একটি সেলফি\n৩) একটি ব্যাঙ্ক স্টেটমেন্ট/ইউটিলিটি বিল\nএকবার আপলোড হয়ে গেলে, ইউজার একটি "টেম্পোরারি এপ্রুভড" স্ট্যাটাস পাবেন এবং ডকুমেন্টগুলো এখন আমাদের কাছে থাকবে এবং "কেওয়াইসি টিম" এর কাছে প্রেরণের জন্য ২৪ ঘন্টা লাগবে এবং তারপর ইউজারকে ফলাফল সম্পর্কে ইমেল করবে:\nএপ্রুভাল\nরিজেকশন\nআরও তথ্যের প্রয়োজন - স্ট্যাটাস এ কোন পরিবর্তন নেই\nযখন ব্যবহারকারী "টেম্পোরারি এপ্রুভড" স্ট্যাটাস দেখে\nতারা প্ল্যাটফর্মটি স্বাভাবিকভাবে ব্যবহার করতে পারে\nতারা মোট ৫০০ ইউরো এর বেশি জমা করতে পারে না\nতারা কোন উইথড্র সম্পূর্ণ করতে পারবে না।`,
          },
        ],
      },
    },
  ];

  return (
    <div className="bg-[#4e4e4e]">
      <Container>
        <Tabs className="flex flex-col md:flex-row items-start gap-6 md:gap-14 py-10">
          {/* Tab List */}
          <TabList className="flex flex-row md:flex-col items-start md:items-center w-full md:w-60 bg-white rounded-md overflow-hidden">
            {tabsData?.map((tab, index) => (
              <Tab
                key={index}
                className="w-full text-left md:text-center text-[#4e4e4e] py-3 px-4 cursor-pointer border-b md:border-b-0 md:border-l border-transparent hover:border-white hover:bg-[#14805e] hover:text-white outline-none"
                selectedClassName="bg-[#14805e] text-white"
              >
                {tab.label}
              </Tab>
            ))}
          </TabList>

          {/* Tab Panels */}
          <div className="w-full bg-transparent">
            {tabsData?.map((tab, index) => (
              <TabPanel key={index}>
                {tab.contentData ? (
                  <SiteInfoTabPanelContent data={tab.contentData} />
                ) : (
                  tab.content || <div>No content available</div>
                )}
              </TabPanel>
            ))}
          </div>
        </Tabs>
      </Container>
    </div>
  );
};

export default SiteInfo;
